# 문제 정의
## 미국의 인구조사 데이터()를 바탕으로 만들어진 데이터
## 이 데이터에서 각 사람의 소득을 예측하려는 것이 목적
## 나이, 결혼여부, 직종 등의 칼럼이 있음

레이블(타깃)은 연소들이 $50000 초과(>50K) or 이하(<-50K)로 구분됨(컬럼명 :income)
평가기준은   로 평가
제출팡링른 예측값만 result.csv파일로 생성해 제출(칼럼명-income)

입력(Input, x-독립변수) : 나ㅣㅇ,결혼여부,직종,할력, 근무시간, 등 개인 속성 
출력(Output, y -종속변수) : 소득이 >50K 인지  50K >= (이진값 , 1개)

In [1]:
#1#
# 판다스 라이브러리
import pandas as pd

# 데이터 불러오기
train = pd.read_csv('train.csv')
test = pd.read_csv('test.csv')
# train = pd.read_csv('https://raw.githubusercontent.com/lovedlim/bigdata_analyst_cert/main/part2/ch2/train.csv')
# test = pd.read_csv('https://raw.githubusercontent.com/lovedlim/bigdata_analyst_cert/main/part2/ch2/test.csv')

In [4]:
# 비교를 위한 원본 데이터 불러오기
origin_train = pd.read_csv('origin/train.csv')
origin_test = pd.read_csv('origin/test.csv')

In [5]:
df=train.dropna(); # 결측값 모두 삭제 train 적용 안됨, df로 반환형태
train.dropna(inplace=True) # train적용에 결측값 삭제

df = train.dropna(subset=['workclass','occupation'])
print("결측행 삭제 처리 후 : ", df.shape)

결측행 삭제 처리 후 :  (27096, 16)

In [6]:
print("결측열 삭제 처리",train.shape)
# 현재 열 크기 확인

df=train.dropna(axis=1); # 특정 열에 결측치가 하나라도 있으면 해당 열 전체가 제거됨
train.dropna(inplace=True) # train적용에 결측값 삭제

df = train.drop(['workclass','occupation'],axis=1) # 
print("결측열 삭제 처리 후 : ", df.shape)

결측열 삭제 처리 (27096, 16)
결측열 삭제 처리 후 :  (27096, 14)

In [2]:
#2#
train.describe(include="O")
train['workclass'].mode()

#3#
train['workclass'].mode()[0]

#4#
# train.describe(include="O")

m1=train['workclass'].mode()[0]
train['workclass'] = train['workclass'].fillna(m1)

train.isnull().sum()

id                   0
age                 12
workclass            0
fnlwgt               0
education            0
education.num        0
marital.status       0
occupation        1668
relationship         0
race                 0
sex                  0
capital.gain         0
capital.loss         0
hours.per.week      13
native.country     537
income               0
dtype: int64

In [3]:
#5#
# train.describe(include="O")
m2 = train['native.country'].mode()[0]
train['native.country'] = train['native.country'].fillna(m2)
train.isnull().sum()

id                   0
age                 12
workclass            0
fnlwgt               0
education            0
education.num        0
marital.status       0
occupation        1668
relationship         0
race                 0
sex                  0
capital.gain         0
capital.loss         0
hours.per.week      13
native.country       0
income               0
dtype: int64

In [4]:
#6#
train['occupation'] = train['occupation'].fillna('X') 
train['occupation'].value_counts() # occupation 컬럼의 값별 개수 확인

occupation
Prof-specialty       3683
Craft-repair         3677
Exec-managerial      3632
Adm-clerical         3411
Sales                3295
Other-service        2993
Machine-op-inspct    1822
X                    1668
Transport-moving     1434
Handlers-cleaners    1223
Farming-fishing       891
Tech-support          842
Protective-serv       590
Priv-house-serv       135
Armed-Forces            8
Name: count, dtype: int64

In [5]:
#7#
value = int(train['age'].mean()) # train 데이터프레임의 'age' 열 평균값을 계산
value

#8#
train['age'] = train['age'].fillna(value) 
# train 데이터프레임의 'age' 열에서 결측치(NaN)를 평균값으로 대체
# train.isnull().sum()

In [6]:
train.isnull().sum()

id                 0
age                0
workclass          0
fnlwgt             0
education          0
education.num      0
marital.status     0
occupation         0
relationship       0
race               0
sex                0
capital.gain       0
capital.loss       0
hours.per.week    13
native.country     0
income             0
dtype: int64

In [7]:
#9#
value = int(train['hours.per.week'].median())
train['hours.per.week'] = train['hours.per.week'].fillna(value)
train.isnull().sum()

#10#
test.isnull().sum()

id                  0
age                 6
workclass         174
fnlwgt              0
education           0
education.num       0
marital.status      0
occupation        175
relationship        0
race                0
sex                 0
capital.gain        0
capital.loss        0
hours.per.week      9
native.country     46
dtype: int64

In [8]:
#11,12#
test['workclass'].mode()
m1=test['workclass'].mode()[0]
test['workclass'] = test['workclass'].fillna(m1)
test.isnull().sum()

id                  0
age                 6
workclass           0
fnlwgt              0
education           0
education.num       0
marital.status      0
occupation        175
relationship        0
race                0
sex                 0
capital.gain        0
capital.loss        0
hours.per.week      9
native.country     46
dtype: int64

In [9]:
#13#
# test['native.country'].mode()
m2=test['native.country'].mode()[0]
test['native.country'] = test['native.country'].fillna(m2)
# test.isnull().sum()

In [10]:
#14#
# occupation 
test['occupation'] = test['occupation'].fillna('X') 
test['occupation'].value_counts() # occupation 컬럼의 값별 개수 확인

occupation
Prof-specialty       457
Exec-managerial      434
Craft-repair         422
Adm-clerical         359
Sales                355
Other-service        302
Machine-op-inspct    180
X                    175
Transport-moving     163
Handlers-cleaners    147
Farming-fishing      103
Tech-support          86
Protective-serv       59
Priv-house-serv       14
Armed-Forces           1
Name: count, dtype: int64

In [11]:
#15#
# test['age'].mode()
m2=test['age'].mode()[0]
test['age'] = test['age'].fillna(m2)
# test.isnull().sum()

In [12]:
#16#
value = int(train['hours.per.week'].median())
train['hours.per.week'] = train['hours.per.week'].fillna(value)
# train.isnull().sum()

In [13]:
train.describe()

,id,age,fnlwgt,education.num,capital.gain,capital.loss,hours.per.week
count,29304.000000,29304.000000,2.930400e+04,29304.000000,29304.000000,29304.000000,29304.000000
mean,16264.027880,38.552996,1.897488e+05,10.080842,1093.858722,86.744506,40.434036
std,9384.518323,13.626025,1.055250e+05,2.570824,7477.435640,401.518928,12.321306
min,0.000000,-38.000000,1.228500e+04,1.000000,0.000000,0.000000,1.000000
25%,8145.750000,28.000000,1.177890e+05,9.000000,0.000000,0.000000,40.000000
50%,16253.500000,37.000000,1.783765e+05,10.000000,0.000000,0.000000,40.000000
75%,24374.250000,48.000000,2.370682e+05,12.000000,0.000000,0.000000,45.000000
max,32560.000000,90.000000,1.484705e+06,16.000000,99999.000000,4356.000000,99.000000

In [14]:
#17#
train[train['age']<=0]
train.describe()
train = train[train['age']>0]

train[train['age']<=0]

Empty DataFrame
Columns: [id, age, workclass, fnlwgt, education, education.num, marital.status, occupation, relationship, race, sex, capital.gain, capital.loss, hours.per.week, native.country, income]
Index: []

In [15]:
#18#
y_train = train.pop("income") # 한번만 실행 -> 나중실행은 이미 지워지고 없음
print(y_train)
# print("====================================")
print(train)
train.shape,test.shape

0         >50K
1        <=50K
2        <=50K
3         >50K
4        <=50K
         ...
29299    <=50K
29300    <=50K
29301    <=50K
29302    <=50K
29303    <=50K
Name: income, Length: 29301, dtype: object
          id   age  workclass  fnlwgt     education  education.num  \
0       3331  34.0  State-gov  177331  Some-college             10
1      19749  58.0    Private  290661       HS-grad              9
2       1157  48.0    Private  125933  Some-college             10
3        693  58.0    Private  100313  Some-college             10
4      12522  41.0    Private  195661  Some-college             10
...      ...   ...        ...     ...           ...            ...
29299  15999  28.0    Private   47168          10th              6
29300  21604  44.0  Local-gov  231793     Doctorate             16
29301  26839  41.0  Local-gov  201435       HS-grad              9
29302  16681  43.0    Private  137722       HS-grad              9
29303  16069  22.0    Private  406978     Bachelors             13

              marital.status         occupation    relationship   race  \
0         Married-civ-spouse     Prof-specialty         Husband  Black
1         Married-civ-spouse       Craft-repair         Husband  White
2                    Widowed    Exec-managerial       Unmarried  Black
3         Married-civ-spouse    Protective-serv         Husband  White
4         Married-civ-spouse   Transport-moving         Husband  White
...                      ...                ...             ...    ...
29299          Never-married  Machine-op-inspct       Own-child  White
29300  Married-spouse-absent     Prof-specialty       Unmarried  White
29301     Married-civ-spouse   Transport-moving         Husband  Black
29302     Married-civ-spouse  Handlers-cleaners         Husband  White
29303          Never-married    Exec-managerial  Other-relative  White

          sex  capital.gain  capital.loss  hours.per.week native.country
0        Male          4386             0            40.0  United-States
1        Male             0             0            40.0  United-States
2      Female             0          1669            38.0  United-States
3        Male             0          1902            40.0  United-States
4        Male             0             0            54.0  United-States
...       ...           ...           ...             ...            ...
29299  Female             0             0            40.0  United-States
29300  Female             0             0            38.0  United-States
29301    Male             0             0            40.0  United-States
29302    Male             0             0            40.0  United-States
29303  Female             0             0            40.0  United-States

[29301 rows x 15 columns]

((29301, 15), (3257, 15))

In [16]:
#19#
cols=train.select_dtypes(include="object").columns
cols

cols=train.columns[train.dtypes == object]
cols

cols = ['workclass', 'education', 'marital.status', 'occupation', 
        'relationship', 'race', 'sex', 'native.country']

In [17]:
#20#
from sklearn.preprocessing import LabelEncoder

for col in cols:
    le = LabelEncoder()
    train[col] = le.fit_transform(train[col])
    test[col] = le.transform(test[col])

train

,id,age,workclass,fnlwgt,education,education.num,marital.status,occupation,relationship,race,sex,capital.gain,capital.loss,hours.per.week,native.country
0,3331,34.0,6,177331,15,10,2,9,0,2,1,4386,0,40.0,38
1,19749,58.0,3,290661,11,9,2,2,0,4,1,0,0,40.0,38
2,1157,48.0,3,125933,15,10,6,3,4,2,0,0,1669,38.0,38
3,693,58.0,3,100313,15,10,2,10,0,4,1,0,1902,40.0,38
4,12522,41.0,3,195661,15,10,2,13,0,4,1,0,0,54.0,38
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
29299,15999,28.0,3,47168,0,6,4,6,3,4,0,0,0,40.0,38
29300,21604,44.0,1,231793,10,16,3,9,4,4,0,0,0,38.0,38
29301,26839,41.0,1,201435,11,9,2,13,0,2,1,0,0,40.0,38
29302,16681,43.0,3,137722,11,9,2,5,0,4,1,0,0,40.0,38
29303,16069,22.0,3,406978,9,13,4,3,2,4,0,0,0,40.0,38

In [18]:
#22#
#방법1
## map() 은 딕셔너리 매핑을 통해 문자열을 숫자로 치환합니다.
target = y_train.map({'<=50K':0, '>50K':1})
target.value_counts()
target

# # 방법2
# ## replace()도 특정 값을 다른 값으로 치환하는 방식
# ## 결과적으로 map()과 동일한 결과를 얻습니다.
# target = y_train.replace('<=50K', 0).replace('>50K', 1)
# target.value_counts()
# target

0        1
1        0
2        0
3        1
4        0
        ..
29299    0
29300    0
29301    0
29302    0
29303    0
Name: income, Length: 29301, dtype: int64

In [19]:
# 데이터를 매번 새롭게 불러오기 위해 함수로 제작 함
def get_data():
    train_copy = train.copy()
    test_copy = test.copy()
    return train_copy, test_copy

In [20]:
### STANDARD 스케일링
# 범위: 평균 0, 표준편차 1 (정규분포 형태로 변환)
# 언제쓰나 : 데이터가 정규분포(가우시안 분포)에 가까운 경우
# 언제쓰나 : 선형 모델 (선형 회귀, 로지스틱 회귀, SVM, PCA, LDA 등) → 가정이 평균=0, 분산=1일 때 잘 작동

train_copy, test_copy = get_data()

from sklearn.preprocessing import StandardScaler
scaler = StandardScaler()
display(train_copy[cols].head(2))
train_copy[cols] = scaler.fit_transform(train_copy[cols])
test_copy[cols] = scaler.transform(test_copy[cols])
display(train_copy[cols].head(2))

,workclass,education,marital.status,occupation,relationship,race,sex,native.country
0,6,15,2,9,0,2,1,38
1,3,11,2,2,0,4,1,38

,workclass,education,marital.status,occupation,relationship,race,sex,native.country
0,2.627051,1.215793,-0.40587,0.594390,-0.902062,-1.960187,0.704882,0.2611
1,-0.087614,0.180416,-0.40587,-1.021687,-0.902062,0.394352,0.704882,0.2611